; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v11 ?v9)
             (pred_2 ?v2 ?v6)
             (pred_5 ?v11 ?v6)
             (pred_8 ?v3 ?v11 )
	     (pred_12 ?v11)
             (pred_4 ?v10)
             (pred_7 ?v2)
             (pred_3 ?v6)
             (pred_11 ?v11)
             (pred_6 ?v2)
             (pred_9 ?v11)
             (pred_10 ))



(:action op_5
:parameters (?v5 ?v1 ?v7 ?v8)
:precondition (and (pred_4 ?v5) (pred_4 ?v1) (pred_7 ?v7) (pred_3 ?v8)
          (pred_1 ?v5 ?v1) (pred_2 ?v7 ?v8)
                   (pred_5 ?v1 ?v8) (pred_12 ?v5) 
                   (pred_11 ?v1) (pred_6 ?v7))
:effect (and  (pred_9 ?v1) (not (pred_11 ?v1))))


(:action op_2
:parameters (?v5 ?v12)
:precondition (and (pred_4 ?v5) (pred_4 ?v12)
               (pred_12 ?v5) (pred_1 ?v5 ?v12) (pred_9 ?v12))
:effect (and (pred_12 ?v12) (not (pred_12 ?v5))))

(:action op_3
:parameters (?v5 ?v7)
:precondition (and (pred_4 ?v5) (pred_7 ?v7) 
                  (pred_12 ?v5) (pred_8 ?v7 ?v5) (pred_10 ))
:effect (and (pred_6 ?v7)
   (not (pred_8 ?v7 ?v5)) (not (pred_10 ))))


(:action op_1
:parameters (?v5 ?v13 ?v4)
:precondition (and (pred_4 ?v5) (pred_7 ?v13) (pred_7 ?v4)
                  (pred_12 ?v5) (pred_6 ?v4) (pred_8 ?v13 ?v5))
:effect (and (pred_6 ?v13) (pred_8 ?v4 ?v5)
        (not (pred_6 ?v4)) (not (pred_8 ?v13 ?v5))))

(:action op_4
:parameters (?v5 ?v7)
:precondition (and (pred_4 ?v5) (pred_7 ?v7) 
                  (pred_12 ?v5) (pred_6 ?v7))
:effect (and (pred_10 ) (pred_8 ?v7 ?v5) (not (pred_6 ?v7)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_11 obj_13 obj_10 obj_06 obj_07 obj_17 obj_12 obj_14 obj_03 obj_19 obj_15 obj_20 obj_08 obj_01 obj_02 obj_09
    obj_04 obj_05
    obj_16 obj_18
    )

    (:init
       (pred_10)

       (pred_4 obj_11)
       (pred_4 obj_13)
       (pred_4 obj_10)
       (pred_4 obj_06)
       (pred_4 obj_07)
       (pred_4 obj_17)
       (pred_4 obj_12)
       (pred_4 obj_14)
       (pred_4 obj_03)
       (pred_4 obj_19)
       (pred_4 obj_15)
       (pred_4 obj_20)
       (pred_4 obj_08)
       (pred_4 obj_01)
       (pred_4 obj_02)
       (pred_4 obj_09)
       (pred_3 obj_04)
       (pred_3 obj_05)
       (pred_7 obj_16)
       (pred_7 obj_18)

       (pred_1 obj_11 obj_07)
       (pred_1 obj_11 obj_13)
       (pred_1 obj_13 obj_17)
       (pred_1 obj_13 obj_10)
       (pred_1 obj_13 obj_11)
       (pred_1 obj_10 obj_12)
       (pred_1 obj_10 obj_06)
       (pred_1 obj_10 obj_13)
       (pred_1 obj_06 obj_14)
       (pred_1 obj_06 obj_10)
       (pred_1 obj_07 obj_03)
       (pred_1 obj_07 obj_17)
       (pred_1 obj_07 obj_11)
       (pred_1 obj_17 obj_19)
       (pred_1 obj_17 obj_12)
       (pred_1 obj_17 obj_13)
       (pred_1 obj_17 obj_07)
       (pred_1 obj_12 obj_15)
       (pred_1 obj_12 obj_14)
       (pred_1 obj_12 obj_10)
       (pred_1 obj_12 obj_17)
       (pred_1 obj_14 obj_20)
       (pred_1 obj_14 obj_06)
       (pred_1 obj_14 obj_12)
       (pred_1 obj_03 obj_08)
       (pred_1 obj_03 obj_19)
       (pred_1 obj_03 obj_07)
       (pred_1 obj_19 obj_01)
       (pred_1 obj_19 obj_15)
       (pred_1 obj_19 obj_17)
       (pred_1 obj_19 obj_03)
       (pred_1 obj_15 obj_02)
       (pred_1 obj_15 obj_20)
       (pred_1 obj_15 obj_12)
       (pred_1 obj_15 obj_19)
       (pred_1 obj_20 obj_09)
       (pred_1 obj_20 obj_14)
       (pred_1 obj_20 obj_15)
       (pred_1 obj_08 obj_01)
       (pred_1 obj_08 obj_03)
       (pred_1 obj_01 obj_02)
       (pred_1 obj_01 obj_19)
       (pred_1 obj_01 obj_08)
       (pred_1 obj_02 obj_09)
       (pred_1 obj_02 obj_15)
       (pred_1 obj_02 obj_01)
       (pred_1 obj_09 obj_20)
       (pred_1 obj_09 obj_02)
       (pred_11 obj_17)
       (pred_11 obj_15)
       (pred_5  obj_17 obj_04)
       (pred_5  obj_15 obj_05)
       (pred_9 obj_11)
       (pred_9 obj_13)
       (pred_9 obj_10)
       (pred_9 obj_06)
       (pred_9 obj_07)
       (pred_9 obj_12)
       (pred_9 obj_14)
       (pred_9 obj_03)
       (pred_9 obj_19)
       (pred_9 obj_20)
       (pred_9 obj_08)
       (pred_9 obj_01)
       (pred_9 obj_02)
       (pred_9 obj_09)

       (pred_2  obj_16 obj_04)
       (pred_2  obj_18 obj_05)
       (pred_8 obj_16 obj_08)
       (pred_8 obj_18 obj_01)
       (pred_12 obj_09)
    )

    (:goal (and
       (pred_8 obj_18 obj_07)
    ))
(:constraints
  (always (not (pred_12 obj_19)))
)
)

; plan
1. (op_2 obj_09 obj_02)
   deleted: (pred_12 obj_09)
   added: (pred_12 obj_02)
   goals met: 0 of 1
2. (op_2 obj_02 obj_01)
   deleted: (pred_12 obj_02)
   added: (pred_12 obj_01)
   goals met: 0 of 1
3. (op_3 obj_01 obj_18)
   deleted: (pred_8 obj_18 obj_01) (pred_10)
   added: (pred_6 obj_18)
   goals met: 0 of 1
4. (op_2 obj_01 obj_08)
   deleted: (pred_12 obj_01)
   added: (pred_12 obj_08)
   goals met: 0 of 1
5. (op_2 obj_08 obj_03)
   deleted: (pred_12 obj_08)
   added: (pred_12 obj_03)
   goals met: 0 of 1
6. (op_2 obj_03 obj_07)
   deleted: (pred_12 obj_03)
   added: (pred_12 obj_07)
   goals met: 0 of 1
7. (op_4 obj_07 obj_18)
   deleted: (pred_6 obj_18)
   added: (pred_10) (pred_8 obj_18 obj_07)
   goals met: 1 of 1
